# Общая информатика

## Лабораторная работа №1
## Шмыкова Дарья 2105-240502D

### Содержание:

1. Условие задачи
2. Блок-схема
3. Код
4. Описание программы

### 1. Задание:

Написать программу, выводящую в табличку значение X и соответствующее значение F(x) с задаваемыми начальным, конечным значениями аргумента и шагом.

### 2. Блок-схема алгоритма:


### 3. Текст и результат работы программы:

```c++
#include <iostream>//директива препроцессора
                   //iostream — заголовочный файл с классами, функциями и переменными для 
                   //организации ввода-вывода в языке программирования C++

using namespace std;
 
int main() //головная программа
{
	cout << "IDEU" << endl;
	cout << "Shmykova Darya" << endl;
	cout << "Group 2105" << endl;
	cout << "LW number 1" << endl << endl;
	cout << "Let us have given numbers from 0 to 1 with a step of 0,1." << endl;
	cout << "Then we calculate the root of these numbers (if the number < 0.5) or the square (if >= 0.5)" << endl;
    cout << "And write the results in a table : " << endl;

	double x=0; double y; int n; // вводим значения переменных x и y
	cout << "\n\n\tX\ty\n\n"; //оформляем таблицу

	for (n = 1; n <= 11; n++) //производим вычисления с помощью цикла for
	{
		if (x < 0.5) //условный оператор if … else
		{
			y = sqrt(x); //производим расчёты - вычисление корня
			cout << "\t" << x << "\t" << y << "\n"; //оформляем таблицу с результатами
			x = x + 0.1; //переходим к следующему исходному числу x
		}
		else
		{
			y = x * x; // производим расчёты - возведение во вторую степень
			cout << "\t" << x << "\t" << y << "\n"; //оформляем таблицу с результатами
			x = x + 0.1; //переходим к следующему исходному числу x
		}
	}
}
```
